#include <stdio.h>
#define FORMAT "%s! C is cool!\n"
int main(void){
	int num = 10;
	printf(FORMAT,FORMAT);/* Спочатку було виведенно зміст змінної FORMAT(а саме "%s! C is cool!"),
							а потім зміст цієї змінної було підставлено замість %s */
	printf("%d\n",++num);//Значення функції ++num спочатку збільшила змінну n на 1,а потім її значення було виведенно на екран.num=11
	printf("%d\n",num++);//Значення функції num++ було виведенно змінну n на екран,а потім збільшила змінну n на 1.num=12
	printf("%d\n",num--);//Значення функції --num спочатку зменшила змінну n на 1,а потім її значення було виведенно на екран.num=11
	printf("%d\n",--num);//Значення функції num-- було виведенно змінну n на екран,а потім зменшила змінну n на 1.num=10
	return 0;
}