#include <stdio.h>
char *pr(char *str);
int main(void){
	char x;
	x = pr("Ho Ho Ho!");
	printf("%c",x);
	return 0;
}
char *pr(char *str){
	char *pc;
	pc = str;
	while (*pc)
		putchar(*pc++);
	do{
		putchar(*--pc);
	}while(pc-str);
	return (pc);
}
/*
A - Функція виведе:"Ho Ho Ho!!oH oH oH"
B - тип char
C - x матиме значення \0
D - вираз "*--pc" означає що спочатку буде зменшуватись адреса поінтера на 1,тобто перейде до попереднього елемента,а потім перейде до значення за цією адресою
вираз "*--pc" відрізнається від "--*pc"тим,що "*--pc" зменшує адресу на 1,а "--*pc" зменшує значення поінтера за цією адресою,тобто зменшує символ за таблицею ASCII на 1
E - якшо вираз "*--pc" замінити на "*pc--",то в результаті компілятор буде спочатку виконувати певні дії з поінтером pc,а в кінці його адресу зменшить на 1,в результаті
останній елемент може бути не використаний
F - два цикли while використовуються для виводу елементів типу char в консоль
Перший цикл while використовується для того,щоб вивести елементи (в заданому порядку) по порядку,Другий цикл while - щоб вивести елементи в зворотньому порядку
G - якшо pr() надійде з порожнім рядком замість аргументу,то функція вийде за межі виділеної пам'яті і почне друкувати символи з сусідніх комірок памяті
з сусідніми адресами
H - не писати в код програми 'call:',взяти виклик функції в дужки та надрукувати перед нею '*' */ 